package random;

public class QofBook_134_147 {

	public static void main(String[] args) {
	
		
//--------------------------------------------------------------------------------------		
		int score = 85; 
		System.out.println("등급은 ");
		
		if (score < 70) {
			System.out.println("D");
			
		} else if (score < 80) {
			System.out.println("C");

		} else if (score < 90) {
			System.out.println("B");

		} else {
			System.out.println("A");
		}
//--------------------------------------------------------------------------------------	

		System.out.println("어떤 혜택을 원해요?");
		char grade = 'C';
		
		switch (grade) {
		case 'A':	System.out.println("VVIP");
		case 'B':	System.out.println("VIP");	break;
		case 'C':	System.out.println("우수");
		case 'D':	System.out.println("일반");	break;
		default:	System.out.println("혜택이 없습니다");
		}
		
		
		
		
		
//--------------------------------------------------------------------------------------	
//--------------------------------------------------------------------------------------	
//--------------------------------------------------------------------------------------	
//--------------------------------------------------------------------------------------	
//--------------------------------------------------------------------------------------	
//--------------------------------------------------------------------------------------	
	
	
	
	}
}
