

public class Memo1 { /*class 첫글자를 대문자
								객체 지향 언어에서 프로그램을 개발하는 단위
								적어도 하나 이상의 클래스가 있어야 함
								클래스 이름과 소스 파일의 이름은 같아야 함
								클래스 이름은 대문나 시작하는 것이 관례	*/

	public static void main(String[] args) {
						/*메소드
						 * 수행할 작업을 나열한 코드의 모임(기능)
						 * 자바 애플리케이션은 main()메소드(진입점, 시작점) 부터 실행
						 * 실행문(statement)
						 * 작업을 지시하는 변수를 선언, 값 저장, 메소드 호출 등의 코드를 작성
						 * 실행문의 끝에는 반드시 세미콜론 (;) 을 붙여서 실행문이 끝났음을 표
						 */
						
						/* pintln()
						 * print()
						 * printf() : 출력 서식을 지정해서 출력, 줄바꿈 하지 않
						 * 	 		정수 : %d
						 * 	 		실수 : %전체자릿수.소수이하자리수f
						 * 	 		문자열 : %s
						 */
		
						/* 제어문자 
						 * \n :	줄바꿈, new line
						 * \t : 일정한 간격을 띄우기, 주로 위아래 간격 맞출때 사 (tap)?
						 * \" : "
						 * \\ : \
						 */
	
						/* 문자/문자열/정수/실수
						 * 문자 : ' '. 'A' 
						 * 문자열 :"", "A","1","가",
						 * 정수 : 1, 10,....
						 * 실수 : 1.5, 0.07...
						 */

						/* 식별자 규칙(변수명, 함수명, 메소드명 클래스명
						 * 
						 * 첫글자는 반드시 문자, _ , &로 시작
						 * 대소문자 구분+,-ㄴ사잔자 포함 할 수 없음
						 * 키워드(=예약어 사용 할 수 없음)
						 * 공백문자, 특수문자 사용 할 수 없음
						 * */
		
		System.out.println("hello!!");
		
		System.out.println("java /*주석연습*/ is fun");
		/*자바연습 실행 여부 확인 */
		System.out.println("자바는 즐거웡");
		int a_a = 10;
		
		System.out.println(a_a);
	
		
	
	}
	
	
	

}
